<template>
    <div>
        <div name="college">
            <div>
                <el-form :model="form" class="demo-form-inline">
                    <el-form-item label="院校名称">
                        <el-autocomplete v-model="form.collegeName" placeholder="请输入院校名称"
                            :fetch-suggestions="querySearch" @select="handleSelect">
                            <template slot-scope="{ item }">
                                {{ item.value }}
                            </template>
                        </el-autocomplete>
                    </el-form-item>
                    <el-form-item>
                        <el-button type="primary" @click="submitForm">查询</el-button>
                    </el-form-item>
                </el-form>
            </div>
        </div>
        <div name="collegeInfo">
            <el-card>
                <div slot="header" class="clearfix">
                    <span>学校概览</span>
                </div>

                <el-table :data="collegeInfo" style="width:100%">
                    <el-table-column prop="col_id" label="学校代码">
                    </el-table-column>

                    <el-table-column prop="col_name" label="学校名称">
                    </el-table-column>

                    <el-table-column prop=" col_usedname" label="曾用名称">
                    </el-table-column>

                    <el-table-column prop="col_type" label="学校类型">
                    </el-table-column>
                    <el-table-column prop="col_batch" label="批次">
                    </el-table-column>
                    <el-table-column prop=" col_province" label="所在省份">
                    </el-table-column>

                    <el-table-column prop="col_city" label="所在城市">
                    </el-table-column>
                    <el-table-column prop=" col_blong" label="所属部门">
                    </el-table-column>
                    <el-table-column prop="col_is_public" label="是否公办">
                    </el-table-column>

                    <el-table-column prop="col_is_985" label="是否985">
                    </el-table-column>
                    <el-table-column prop=" col_is_211" label="是否211">
                    </el-table-column>
                    <el-table-column prop=" col_is_top" label="是否双一流">
                    </el-table-column>


                </el-table>
            </el-card>
        </div>

        <div name="collegechat">
            <el-card>
                <div class="clearfix">
                    <p><strong>大学名称：【{{ form.collegeName }}】</strong></p>
                    <h4 style="text-align: center;">大学生活指北</h4>
                    <p style="text-align: center;">免责申明：本页面内容均来源于问卷收集，仅供参考，请自行确定信息准确性和真实性~</p>
                </div>

                <div v-for="(question, index) in col_question" :key="index" class="question">
                    <h4>{{ question }}</h4>
                    <ul class="result">
                        <li v-for="(answer, idx) in groupedAnswers" :key="idx">
                            <p class="answer">answer-I {{ answer[0] }}</p>
                            <p class="answer">answer-II {{ answer[1] }}</p>
                            <p class="answer">answer-III {{ answer[2] }}</p>
                        </li>
                    </ul>
                </div>
            </el-card>

        </div>
    </div>
</template>

<script>
import { UserFormRules } from '@/datas/validationRules.js';
import axios from 'axios';
export default {
    name: 'CollegeContent',
    components: {


    },
    data() {
        return {

            form: {
                route: "college",
                collegeName: "清华大学",
                timerstamp: new Date().getTime(),
            },
            colleges: [
                "北京大学", "中国人民大学", "清华大学", "北京交通大学", "北京工业大学", "北京航空航天大学", "北京理工大学", "北京科技大学", "北方工业大学", "北京化工大学", "北京工商大学", "北京邮电大学", "北京印刷学院", "北京建筑大学", "中国农业大学", "北京林业大学", "北京中医药大学", "北京外国语大学", "中国传媒大学", "中央财经大学", "北京物资学院", "首都经济贸易大学", "北京体育大学", "中央民族大学", "中国政法大学", "华北电力大学", "南开大学", "天津大学", "天津科技大学", "天津工业大学", "中国民航大学", "天津理工大学", "天津农学院", "天津医科大学", "天津师范大学", "天津职业技术师范大学", "天津外国语大学", "天津商业大学", "天津财经大学", "河北工程大学", "河北地质大学", "华北水利水电大学", "河北工业大学", "华北理工大学", "河北医科大学", "河北师范大学", "邯郸学院", "邢台学院", "石家庄铁道大学", "太原科技大学", "中北大学", "太原理工大学", "山西农业大学", "山西医科大学", "长治医学院", "太原师范学院", "山西大同大学", "晋中学院", "运城学院", "山西财经大学", "内蒙古科技大学", "内蒙古工业大学", "内蒙古农业大学", "内蒙古医科大学", "内蒙古师范大学", "内蒙古民族大学", "赤峰学院", "内蒙古财经大学", "辽宁大学", "大连理工大学盘锦校区", "沈阳工业大学", "东北大学", "辽宁科技大学", "辽宁工程技术大学", "辽宁石油化工大学", "沈阳化工大学", "大连交通大学", "大连海事大学", "大连工业大学", "沈阳建筑大学", "辽宁工业大学", "沈阳农业大学", "大连海洋大学", "中国医科大学", "锦州医科大学", "大连医科大学", "沈阳药科大学", "沈阳医学院", "辽宁师范大学", "鞍山师范学院", "东北财经大学", "铁岭师范高等专科学校", "吉林大学", "延边大学", "长春理工大学", "东北电力大学", "吉林化工学院", "吉林农业大学", "长春中医药大学", "东北师范大学", "北华大学", "通化师范学院", "吉林师范大学", "白城师范学院", "吉林财经大学", "吉林体育学院", "黑龙江大学", "哈尔滨工业大学", "哈尔滨理工大学", "燕山大学", "哈尔滨工程大学", "黑龙江科技大学", "东北石油大学", "佳木斯大学", "东北农业大学", "东北林业大学", "黑龙江中医药大学", "哈尔滨师范大学", "齐齐哈尔大学", "哈尔滨学院", "齐齐哈尔高等师范专科学校", "哈尔滨商业大学", "哈尔滨金融学院", "复旦大学", "同济大学", "上海交通大学", "华东理工大学", "上海理工大学", "上海海事大学", "东华大学", "上海电力大学", "上海应用技术大学", "上海健康医学院", "上海海洋大学", "华东师范大学", "上海外国语大学", "上海财经大学", "上海海关学院", "华东政法大学", "南京大学", "苏州大学", "东南大学", "南京航空航天大学", "南京理工大学", "江苏科技大学", "中国矿业大学", "南京工业大学", "常州大学", "南京邮电大学", "河海大学", "江南大学", "南京林业大学", "江苏大学", "南京信息工程大学", "南通大学", "盐城工学院", "南京农业大学", "南京中医药大学", "中国药科大学", "盐城师范学院", "苏州科技大学", "浙江大学", "杭州电子科技大学", "浙江工业大学", "浙江农林大学", "浙江师范大学", "浙江工商大学", "嘉兴学院", "中国计量大学", "中国科学技术大学", "合肥工业大学", "安徽理工大学", "安徽农业大学", "淮北师范大学", "安徽财经大学", "淮南师范学院", "厦门大学", "华侨大学", "福州大学", "福建工程学院", "福建农林大学", "集美大学", "福建医科大学", "闽江学院", "泉州师范学院", "南昌大学", "华东交通大学", "东华理工大学", "江西理工大学", "江西农业大学", "江西中医药大学", "赣南医学院", "江西师范大学", "上饶师范学院", "井冈山大学", "江西财经大学", "山东大学", "中国海洋大学", "山东科技大学", "中国石油大学（华东）", "青岛科技大学", "济南大学", "青岛理工大学", "山东建筑大学", "山东理工大学", "山东农业大学", "青岛农业大学", "潍坊医学院", "滨州医学院", "山东医学高等专科学校", "济宁医学院", "山东师范大学", "德州学院", "鲁东大学", "菏泽学院", "山东财经大学", "郑州大学", "河南理工大学", "郑州轻工业大学", "河南工业大学", "中原工学院", "河南农业大学", "河南科技学院", "河南中医药大学", "新乡医学院", "河南大学", "河南师范大学", "信阳师范学院", "周口师范学院", "安阳师范学院", "许昌学院", "南阳师范学院", "洛阳师范学院", "河南财经政法大学", "郑州航空工业管理学院", "武汉大学", "华中科技大学", "武汉科技大学", "长江大学", "武汉工程大学", "中国地质大学（武汉）", "武汉纺织大学", "武汉轻工大学", "武汉理工大学", "湖北工业大学", "华中农业大学", "华中师范大学", "湖北大学", "黄冈师范学院", "汉江师范学院", "湖北文理学院", "中南财经政法大学", "中南民族大学", "湘潭大学", "湖南大学", "中南大学", "湖南科技大学", "长沙理工大学", "湖南农业大学", "中南林业科技大学", "湖南中医药大学", "湖南师范大学", "湖南理工学院", "衡阳师范学院", "邵阳学院", "湖南文理学院", "湖南人文科技学院", "湖南工商大学", "南华大学", "中山大学", "暨南大学", "华南理工大学", "广州中医药大学", "韶关学院", "惠州学院", "海南大学", "广西大学", "广西科技大学", "桂林理工大学", "广西民族大学", "四川大学", "重庆大学", "西南交通大学", "电子科技大学", "西南石油大学", "成都理工大学", "重庆邮电大学", "重庆交通大学", "西南科技大学", "成都信息工程大学", "四川轻化工大学", "中国民用航空飞行学院", "四川农业大学", "重庆医科大学", "西南医科大学", "成都中医药大学", "川北医学院", "西南大学", "四川师范大学", "重庆师范大学", "西华师范大学", "绵阳师范学院", "内江师范学院", "宜宾学院", "重庆文理学院", "重庆三峡学院", "四川文理学院", "长江师范学院", "乐山师范学院", "西南财经大学", "西南政法大学", "西南民族大学", "贵州大学", "贵州医科大学", "贵州财经大学", "云南大学", "昆明理工大学", "云南农业大学", "西南林业大学", "昆明医科大学", "大理大学", "云南财经大学", "西北大学", "西安交通大学", "西北工业大学", "西安理工大学", "西安电子科技大学", "西安工业大学", "西安建筑科技大学", "西安科技大学", "西安石油大学", "陕西科技大学", "西安工程大学", "长安大学", "西北农林科技大学", "陕西中医药大学", "陕西师范大学", "延安大学", "陕西理工大学", "咸阳师范学院", "渭南师范学院", "西安外国语大学", "西北政法大学", "兰州大学", "兰州理工大学", "兰州交通大学", "甘肃农业大学", "甘肃中医药大学", "西北师范大学", "兰州城市学院", "陇东学院", "天水师范学院", "兰州财经大学", "西北民族大学", "青海大学", "青海民族大学", "宁夏大学", "宁夏医科大学", "宁夏师范学院", "新疆大学", "塔里木大学", "新疆农业大学", "石河子大学", "新疆师范大学", "喀什大学", "和田师范专科学校", "新疆财经大学", "天津城建大学", "河北科技师范学院", "山西中医药大学", "吕梁学院", "长沙医学院", "齐鲁医药学院", "明达职业技术学院", "长沙民政职业技术学院", "陕西工业职业技术学院", "湖南工业职业技术学院", "武汉职业技术学院", "辽宁对外经贸学院", "三门峡职业技术学院", "郑州铁路职业技术学院", "大连职业技术学院", "江西科技学院", "辽源职业技术学院", "无锡职业技术学院", "江苏建筑职业技术学院", "南京工业职业技术大学", "上海工商职业技术学院", "上海工程技术大学", "天津天狮学院", "内蒙古建筑职业技术学院", "江西医学高等专科学校", "景德镇学院", "萍乡学院", "黄淮学院", "平顶山学院", "湖北理工学院", "湖北医药学院", "吉林外国语大学", "杨凌职业技术学院", "新疆工程学院", "天津市职业大学", "邯郸职业技术学院", "沈阳大学", "牡丹江大学", "上海立信会计金融学院", "厦门理工学院", "青岛大学", "烟台大学", "潍坊学院", "郑州工程技术学院", "开封大学", "洛阳理工学院", "荆州理工职业学院", "三峡大学", "广州大学", "西安文理学院", "海南热带海洋学院", "华北科技学院", "成都工业学院", "齐齐哈尔医学院", "北京信息科技大学", "太原学院", "大连大学", "吉林工商学院", "南京工程学院", "南京审计大学", "三明学院", "龙岩学院", "福建商学院", "江西科技师范大学", "南昌工程学院", "河南工学院", "安阳工学院", "湖北工业职业技术学院", "荆楚理工学院", "梧州学院", "玉溪师范学院", "云南警官学院", "榆林学院", "安康学院", "甘肃政法大学", "北方民族大学", "中国矿业大学（北京）", "中国石油大学（北京）", "中国地质大学（北京）", "北京联合大学", "河北金融学院", "集宁师范学院", "长春汽车工业高等专科学校", "长春工程学院", "长春金融高等专科学校", "黑龙江工业学院", "黑龙江职业学院", "上海电机学院", "南京晓庄学院", "浙江财经大学", "九江职业大学", "新余学院", "山东交通学院", "河南工程学院", "焦作大学", "湖南城市学院", "湖南工学院", "湖南财政经济学院", "湖南工业大学", "广东金融学院", "重庆科技学院", "文山学院", "西安财经大学", "甘肃民族师范学院", "兰州文理学院", "连云港师范高等专科学校", "湖北经济学院", "北部湾大学", "沈阳工程学院", "浙江传媒学院", "河南财政金融学院", "南阳理工学院", "海南师范大学", "重庆理工大学", "黔南民族医学高等专科学校", "西安邮电大学", "山东工商学院", "长春大学", "上海出版印刷高等专科学校", "西安航空学院", "防灾科技学院", "九江职业技术学院", "重庆工商大学", "甘肃医学院", "陇南师范高等专科学校", "海南医学院", "新疆维吾尔医学专科学校", "长春医学高等专科学校", "西安电力高等专科学校", "上海杉达学院", "黄河科技学院", "桂林旅游学院", "西安医学院", "九江学院", "广东工业大学", "徐州工程学院", "大连民族大学", "广州民航职业技术学院", "上海第二工业大学", "江苏经贸职业技术学院", "南京特殊教育师范学院", "吉林交通职业技术学院", "上海商学院", "九州职业技术学院", "长沙航空职业技术学院", "黄河水利职业技术学院", "日照职业技术学院", "天津中德应用技术大学", "南方医科大学", "南京森林警察学院", "湖南医药学院", "重庆工业职业技术学院", "湖南大众传媒职业技术学院", "永州职业技术学院", "湖南铁道职业技术学院", "湖南涉外经济学院", "海口经济学院", "武昌理工学院", "青岛职业技术学院", "威海职业学院", "山东职业学院", "烟台南山学院", "贵州电子信息职业技术学院", "云南国土资源职业学院", "武汉生物工程学院", "武汉工贸职业学院", "湖南交通职业技术学院", "沧州职业技术学院", "石家庄铁路职业技术学院", "湖南工程职业技术学院", "聊城职业技术学院", "中国劳动关系学院", "克拉玛依职业技术学院", "天津滨海职业学院", "上海城建职业学院", "上海海事职业技术学院", "上海电子信息职业技术学院", "陕西能源职业技术学院", "酒泉职业技术学院", "宁夏理工学院", "青海卫生职业技术学院", "上海震旦职业学院", "上海思博职业技术学院", "上海立达学院", "辽宁理工职业大学", "保险职业学院", "重庆机电职业技术大学", "重庆城市科技学院", "广州软件学院", "广东外语外贸大学南国商学院", "福建信息职业技术学院", "泉州医学高等专科学校", "成都东软学院", "四川水利职业技术学院", "南充职业技术学院", "四川邮电职业技术学院", "南华大学船山学院", "湖南理工学院南湖学院", "内蒙古机电职业技术学院", "内蒙古商贸职业学院", "江苏海事职业技术学院", "江苏航运职业技术学院", "泉州纺织服装职业学院", "西安欧亚学院", "西安外事学院", "西安翻译学院", "西京学院", "宁夏民族职业技术学院", "三亚城市职业学院", "天津渤海职业技术学院", "天津电子信息职业技术学院", "天津机电职业技术学院", "天津现代职业技术学院", "天津公安警官职业学院", "天津轻工职业技术学院", "荆州职业技术学院", "商丘职业技术学院", "郑州工业应用技术学院", "平顶山工业职业技术学院", "周口职业技术学院", "湖北交通职业技术学院", "重庆信息技术职业学院", "重庆城市管理职业学院", "重庆工程职业技术学院", "四川交通职业技术学院", "四川工程职业技术学院", "四川建筑职业技术学院", "江西工程学院", "秦皇岛职业技术学院", "山西药科职业学院", "石家庄工程职业学院", "石家庄城市经济职业学院", "唐山职业技术学院", "衡水职业技术学院", "天津商务职业学院", "南昌理工学院", "上海济光职业技术学院", "上海建桥学院", "上海工商外国语职业学院", "天津国土资源和房屋职业学院", "江苏电子信息职业学院", "常州纺织服装职业技术学院", "安徽文达信息工程学院", "宿州职业技术学院", "西双版纳职业技术学院", "陕西国防工业职业技术学院", "西安航空职业技术学院", "陕西财经职业技术学院", "陕西交通职业技术学院", "陕西职业技术学院", "兰州外语职业学院", "兰州职业技术学院", "甘肃警察职业学院", "甘肃林业职业技术学院", "甘肃工业职业技术学院", "宁夏工业职业学院", "德州科技职业学院", "张家界航空工业职业技术学院", "昆明艺术职业学院", "浙江金融职业学院", "天津医学高等专科学校", "天津交通职业学院", "邢台医学高等专科学校", "河北旅游职业学院", "山西机电职业技术学院", "山西林业职业技术学院", "辽宁金融职业学院", "辽宁广告职业学院", "辽宁经济职业技术学院", "鹤岗师范高等专科学校", "哈尔滨铁道职业技术学院", "大兴安岭职业学院", "哈尔滨职业技术学院", "上海邦德职业技术学院", "上海中侨职业技术大学", "南京科技职业学院", "亳州学院", "泉州华光职业学院", "江西司法警官职业学院", "江西应用科技学院", "江西财经职业学院", "江西应用技术职业学院", "江西工业工程职业技术学院", "山东水利职业学院", "山东畜牧兽医职业学院", "郑州师范学院", "焦作师范高等专科学校", "湖北中医药高等专科学校", "四川职业技术学院", "青海农牧科技职业学院", "青海交通职业技术学院", "青海建筑职业技术学院", "江西机电职业技术学院", "武汉铁路职业技术学院", "湖北三峡职业技术学院", "湖北水利水电职业技术学院", "武汉警官职业学院", "武汉外语外事职业学院", "山东英才学院", "山东交通职业学院", "淄博职业学院", "青岛酒店管理职业技术学院", "青岛恒星科技学院", "长沙环境保护职业技术学院", "常德职业技术学院", "湖南化工职业技术学院", "湖南城建职业技术学院", "湖南石油化工职业技术学院", "雅安职业技术学院", "铜仁职业技术学院", "石家庄财经职业学院", "河北交通职业技术学院", "河北化工医药职业技术学院", "河北对外经贸职业学院", "宁夏职业技术学院", "宁夏工商职业技术学院", "宁夏财经职业技术学院", "宁夏警官职业学院", "阿克苏职业技术学院", "常州工业职业技术学院", "常州工程职业技术学院", "江苏农林职业技术学院", "徐州工业职业技术学院", "厦门工学院", "西安思源学院", "西安高新科技职业学院", "陕西国际商贸学院", "西安城市建设职业学院", "陕西服装工程学院", "宁夏建设职业技术学院", "长春职业技术学院", "临汾职业技术学院", "大连工业大学艺术与信息工程学院", "沈阳城市建设学院", "大连医科大学中山学院", "锦州医科大学医疗学院", "大连财经学院", "武汉城市学院", "三峡大学科技学院", "武昌工学院", "荆州学院", "长江大学文理学院", "湖北医药学院药护学院", "湖北恩施学院", "湖北文理学院理工学院", "文华学院", "武汉交通职业学院", "咸宁职业技术学院", "长江工程职业技术学院", "宁波大学科学技术学院", "哈尔滨远东理工学院", "哈尔滨华德学院", "青岛黄海学院", "青岛求实职业技术学院", "山东现代学院", "山东协和学院", "宁夏大学新华学院", "丽江文化旅游学院", "昆明理工大学津桥学院", "昆明文理学院", "昆明医科大学海源学院", "烟台理工学院", "聊城大学东昌学院", "青岛城市学院", "枣庄科技职业学院", "河北科技学院", "河北机电职业技术学院", "廊坊职业技术学院", "石家庄邮电职业技术学院", "石家庄工商职业学院", "石家庄理工职业学院", "河北外国语学院", "石家庄科技信息职业学院", "华北理工大学轻工学院", "河北医科大学临床学院", "江西服装学院", "江西科技职业学院", "南昌工学院", "宜春职业技术学院", "南昌交通学院", "赣东学院", "南昌航空大学科技学院", "赣南科技学院", "南昌医学院", "江西师范大学科学技术学院", "江西财经大学现代经济管理学院", "厦门大学嘉庚学院", "福州大学至诚学院", "郑州财经学院", "河南开封科技传媒学院", "兰州工商学院", "兰州博文科技学院", "兰州信息科技学院", "甘肃交通职业技术学院", "山西工学院", "晋中信息学院", "山西晋中理工学院", "重庆人文科技学院", "陕西铁路工程职业技术学院", "宝鸡职业技术学院", "西安交通工程学院", "陕西电子信息职业技术学院", "金陵科技学院", "海南软件职业技术学院", "海南政法职业学院", "河北工程大学科信学院", "重庆外语外事学院", "重庆对外经贸学院", "重庆财经学院", "重庆工商大学派斯学院", "石家庄铁道大学四方学院", "河北地质大学华信学院", "长春电子科技学院", "长春财经学院", "长春建筑学院", "长春科技学院", "辽宁中医药大学杏林学院", "蚌埠工商学院", "沈阳科技学院", "长春大学旅游学院", "泰山科技学院", "重庆移通学院", "北京工商大学嘉华学院", "大连东软信息学院", "长沙理工大学城南学院", "上海外国语大学贤达经济人文学院", "贵州黔南经济学院", "南京航空航天大学金城学院", "天津外国语大学滨海外事学院", "天津商业大学宝德学院", "天津医科大学临床医学院", "南开大学滨海学院", "电子科技大学成都学院", "武汉华夏理工学院", "广州商学院", "成都理工大学工程技术学院", "成都银杏酒店管理学院", "四川工商学院", "四川外国语大学成都学院", "青海大学昆仑学院", "北京理工大学珠海学院", "西安交通大学城市学院", "西安建筑科技大学华清学院", "西安财经大学行知学院", "陕西科技大学镐京学院", "西安工商学院", "延安大学西安创新学院", "珠海科技学院", "山西管理职业学院", "天津工业职业学院", "天津石油职业技术学院", "天津城市职业学院", "吉林医药学院", "北京培黎职业学院", "黑龙江旅游职业技术学院", "黑龙江能源职业学院", "重庆水利电力职业技术学院", "陕西邮电职业技术学院", "西安海棠职业学院", "西安汽车职业大学", "无锡城市职业技术学院", "无锡工艺职业技术学院", "金山职业技术学院", "云南林业职业技术学院", "福建江夏学院", "厦门华天涉外职业技术学院", "江西中医药高等专科学校", "沧州医学高等专科学校", "南阳医学高等专科学校", "商丘医学高等专科学校", "永城职业学院", "河南经贸职业学院", "郑州旅游职业学院", "江汉艺术职业学院", "武汉民政职业学院", "湖北财税职业学院", "湖南财经工业职业技术学院", "益阳职业技术学院", "琼台师范学院", "陕西警官职业学院", "银川能源学院", "广西演艺职业学院", "湖南信息学院", "山东旅游职业学院", "山东铝业职业学院", "泰山职业技术学院", "天津铁道职业技术学院", "江西航空职业技术学院", "赣西科技职业学院", "三亚学院", "上海师范大学天华学院", "燕京理工学院", "天津师范大学津沽学院", "天津理工大学中环信息学院", "北京科技大学天津学院", "北京中医药大学东方学院", "北京邮电大学世纪学院", "成都锦城学院", "北京工业大学耿丹学院", "乌海职业技术学院", "七台河职业学院", "湖南理工职业技术学院", "新疆交通职业技术学院", "三亚航空旅游职业学院", "陕西经济管理职业技术学院", "湖南水利水电职业技术学院", "广州铁路职业技术学院", "西安铁路职业技术学院", "咸阳职业技术学院", "西安职业技术学院", "商洛职业技术学院", "汉中职业技术学院", "延安职业技术学院", "渭南职业技术学院", "安康职业技术学院", "铜川职业技术学院", "新疆石河子职业技术学院", "苏州百年职业学院", "山东药品食品职业学院", "厦门城市职业学院", "厦门兴才职业技术学院", "无锡学院", "南京邮电大学通达学院", "常州大学怀德学院", "南京审计大学金审学院", "青岛工学院", "齐鲁理工学院", "商丘学院", "重庆三峡医药高等专科学校", "四川中医药高等专科学校", "大庆医学高等专科学校", "石家庄医学高等专科学校", "天津城市建设管理职业技术学院", "天津生物工程职业技术学院", "天津海运职业学院", "陕西青年职业学院", "西安信息职业大学", "陕西旅游烹饪职业学院", "西南财经大学天府学院", "天津仁爱学院", "西安理工大学高科学院", "西安科技大学高新学院", "绵阳城市学院", "吉林铁道职业技术学院", "黑龙江交通职业技术学院", "厦门软件职业技术学院", "三峡电力职业学院", "百色职业学院", "辽宁装备制造职业技术学院", "天津财经大学珠江学院", "运城幼儿师范高等专科学校", "太原工业学院", "哈尔滨科学技术职业学院", "厦门东海职业技术学院", "湖北科技职业学院", "新疆职业大学", "北京社会管理职业学院", "石家庄人民医学高等专科学校", "苏州高博软件技术职业学院", "江西新能源科技职业学院", "广西理工职业技术学院", "南京旅游职业学院", "包头铁道职业技术学院", "辽宁铁道职业技术学院", "辽宁建筑职业学院", "枣庄职业学院", "湖北工程职业学院", "银川科技学院", "内蒙古鸿德文理学院", "石家庄科技职业学院", "乌兰察布医学高等专科学校", "四川幼儿师范高等专科学校", "西安医学高等专科学校", "河北东方学院", "大连汽车职业技术学院", "泉州海洋职业学院", "三亚理工职业学院", "江西冶金职业技术学院", "安阳职业技术学院", "新乡职业技术学院", "重庆交通职业学院", "晋中师范高等专科学校", "承德护理职业学院", "辽宁冶金职业技术学院", "铁岭卫生职业学院", "宿迁泽达职业技术学院", "苏州工业园区服务外包职业学院", "长垣烹饪职业技术学院", "开封文化艺术职业学院", "榆林职业技术学院", "甘肃机电职业技术学院", "石家庄幼儿师范高等专科学校", "徐州幼儿师范高等专科学校", "廊坊卫生职业学院", "阿拉善职业技术学院", "济南护理职业学院", "泰山护理职业学院", "河南护理职业学院", "许昌电气职业学院", "南阳职业学院", "襄阳汽车职业技术学院", "宁夏葡萄酒与防沙治沙职业技术学院", "河南推拿职业学院", "洛阳职业技术学院", "郑州幼儿师范高等专科学校", "安阳幼儿师范高等专科学校", "川北幼儿师范高等专科学校", "上海民航职业技术学院", "运城护理职业学院", "郑州黄河护理职业学院", "四川汽车职业技术学院", "新疆师范高等专科学校", "山西传媒学院", "贵州理工学院", "张家口学院", "运城师范高等专科学校", "渤海理工职业学院", "辽宁轻工职业学院", "陕西艺术职业学院", "新疆铁道职业技术学院", "宜春幼儿师范高等专科学校", "湘南幼儿师范高等专科学校", "宁夏幼儿师范高等专科学校", "毕节医学高等专科学校", "四川西南航空职业学院", "宁夏艺术职业学院", "新疆生产建设兵团兴新职业技术学院", "哈密职业技术学院", "新疆科技职业技术学院", "山西工程技术学院", "鄂尔多斯应用技术学院", "临夏现代职业学院", "武汉海事职业学院", "荆门职业学院", "江苏安全技术职业学院", "武汉铁路桥梁职业学院", "天津滨海汽车工程职业学院", "吉林水利电力职业学院", "三亚中瑞酒店管理职业学院", "河北石油职业技术大学", "河北科技工程职业技术大学", "河北工业职业技术大学", "兰州资源环境职业技术大学", "兰州石化职业技术大学", "宁波诺丁汉大学", "北京师范大学 - 香港浸会大学联合国际学院", "西交利物浦大学", "盐城幼儿师范高等专科学校", "陕西机电职业技术学院", "山西能源学院", "河北环境工程学院", "上海交通大学医学院",
            ],
            showSuggestions: false,
            filteredSuggestions: [],
            collegeInfo: [{
                col_id: "",
                col_name: "",
                col_usedname: "",
                col_type: "",
                col_batch: "",
                col_province: "",
                col_city: "",
                col_blong: "",
                col_is_public: "",
                col_is_985: "",
                col_is_211: "",
                col_is_top: "",
            }],
            col_question: [
                "Q:宿舍是上床下桌吗",
                "Q:教室和宿舍有没有空调",
                "Q: 有独立卫浴吗？没有独立浴室的话，澡堂离宿舍多远",
                "Q: 有早自习、晚自习吗",
                "Q: 有晨跑吗",
                "Q: 每学期跑步打卡的要求是多少公里，可以骑车吗",
                "Q: 寒暑假放多久，每年小学期有多长",
                "Q: 学校允许点外卖吗，取外卖的地方离宿舍楼多远",
                "Q: 学校附近有地铁站吗",
                "Q: 宿舍楼有洗衣机吗",
                "Q: 校园网怎么样",
                "Q: 每天断电断网吗，几点开始断",
                "Q: 食堂价格贵吗，会吃出异物吗",
                "Q: 洗澡热水供应时间",
                "Q: 校园内可以骑电瓶车吗，电池在哪能充电",
                "Q: 宿舍限电情况",
                "Q: 通宵自习有去处吗",
                "Q: 大一能带电脑吗",
                "Q: 学校里面用什么卡，饭堂怎样消费",
                "Q: 学校会给学生发银行卡吗",
                "Q: 学校的超市怎么样",
                "Q: 学校的收发快递政策怎么样",
                "Q: 学校里面的共享单车数目与种类如何",
                "Q: 现阶段学校的门禁情况如何",
                "Q: 宿舍晚上查寝吗，封寝吗，晚归能回去吗",
                "Q:补充说明",
            ],
            answers: []

        };
    },
    computed: {
        groupedAnswers() {
            const grouped = [];
            const chunkSize = 26; // 每个分组的大小

            for (let i = 0; i < this.answers.length; i += chunkSize) {
                grouped.push(this.answers.slice(i, i + chunkSize));
            }

            return grouped;
        }
    },

    rules: UserFormRules,
    methods: {
        querySearch(queryString, cb) {
            const results = queryString ? this.colleges.filter(this.createFilter(queryString)) : this.colleges;
            // 调用 callback 返回建议列表的数据
            cb(results);
        },
        createFilter(queryString) {
            return (college) => {
                return college.toLowerCase().indexOf(queryString.toLowerCase()) !== -1;
            };
        },
        handleSelect(item) {
            this.form.collegeName = item.value;
        },
        submitForm() {
            if (this.form.collegeName) {
                axios.post("/", this.form)
                    .then((response) => {
                        this.collegeInfo = response.data.collegeInfo;
                        this.answers = response.data.answers;
                    })
                    .catch(error => {
                        alert(error);
                    })
            } else {
                return false;
            }
        },
    },
};
</script>
