<template>
    <div>

        <div name="reportingData" v-show="showFlag.reportingData">
            <h1>欢迎使用陌鼓志愿填报</h1>
            <h5>请如实填写以下信息，以便我们为你推荐志愿</h5>
            <el-form name="Reporting" :model="Reporting" :rules="rules.UserFormRules" ref="Reporting"
                @submit.native.prevent="submitForm">

                <el-form-item label="语文成绩" prop=" grade_ch" :rules="rules.UserFormRules.grade_ch"
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.grade_ch" clearabl></el-input>
                </el-form-item>

                <el-form-item label="数学成绩" prop=" grade_ma" :rules="rules.UserFormRules.grade_ma" clearable
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.grade_ma" clearable></el-input>
                </el-form-item>

                <el-form-item label="外语成绩" prop=" grade_en" :rules="rules.UserFormRules.grade_en" clearable
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.grade_en" clearable></el-input>

                </el-form-item>

                <el-form-item label="综合成绩" prop=" grade_comp" :rules="rules.UserFormRules.grade_comp" clearable
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.grade_comp" clearable></el-input>
                </el-form-item>

                <el-form-item label="总成绩" prop=" grade_total" :rules="rules.UserFormRules.grade_total" clearable
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.grade_total" clearable></el-input>
                </el-form-item>

                <el-form-item label="排名" prop=" UserRanking" :rules="rules.UserFormRules.UserRanking" clearable
                    style="width: max-content;">
                    <el-input v-model.number.trim="Reporting.UserRanking" clearable></el-input>
                </el-form-item>

                <!-- 期望城市 -->
                <div name="desired_city">
                    <el-form-item label="城市名称">
                        <el-input v-model="Reporting.Userarea_01" @input="handleSearchCity($event, 'Userarea_01')"
                            placeholder="请输入期待城市名称" clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCity.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedCity($event, 'Userarea_01')"
                            v-show="searchCity.showFlag.Userarea_01">
                            <el-option v-for="item in searchCity.filteredCitys" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>


                    <el-form-item label="城市名称">
                        <el-input v-model="Reporting.Userarea_02" @input="handleSearchCity($event, 'Userarea_02')"
                            placeholder="请输入期待城市名称" clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCity.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedCity($event, 'Userarea_02')"
                            v-show="searchCity.showFlag.Userarea_02">
                            <el-option v-for="item in searchCity.filteredCitys" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>


                    <el-form-item label="城市名称">
                        <el-input v-model="Reporting.Userarea_03" @input="handleSearchCity($event, 'Userarea_03')"
                            placeholder="请输入期待城市名称" clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCity.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedCity($event, 'Userarea_03')"
                            v-show="searchCity.showFlag.Userarea_03">
                            <el-option v-for="item in searchCity.filteredCitys" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>
                </div>
                <!-- 期望专业 -->
                <div name="desired_major">
                    <el-form-item label="专业名称">
                        <el-input v-model="Reporting.desired_major_01"
                            @input="handleSearchMajor($event, 'desired_major_01')" placeholder="请输入期待专业名称" clearable
                            style="width: max-content;"></el-input>
                        <el-select v-model="searchMajor.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_major_01')"
                            v-show="searchMajor.showFlag.desired_major_01">
                            <el-option v-for="item in searchMajor.filteredMajors" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>

                    <el-form-item label="专业名称">
                        <el-input v-model="Reporting.desired_major_02"
                            @input="handleSearchMajor($event, 'desired_major_02')" placeholder="请输入期待专业名称" clearable
                            style="width: max-content;"></el-input>
                        <el-select v-model="searchMajor.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_major_02')"
                            v-show="searchMajor.showFlag.desired_major_02">
                            <el-option v-for="item in searchMajor.filteredMajors" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>

                    <el-form-item label="专业名称">
                        <el-input v-model="Reporting.desired_major_03"
                            @input="handleSearchMajor($event, 'desired_major_03')" placeholder="请输入期待专业名称" clearable
                            style="width: max-content;"></el-input>
                        <el-select v-model="searchMajor.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_major_03')"
                            v-show="searchMajor.showFlag.desired_major_03">
                            <el-option v-for="item in searchMajor.filteredMajors" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>
                </div>
                <!-- 期望学校 -->
                <div name="desired_universities">
                    <el-form-item label="院校名称">
                        <el-input v-model="Reporting.desired_universities_01"
                            @input="handleSearchCollege($event, 'desired_universities_01')" placeholder="请输入期待院校名称"
                            clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCollege.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_universities_01')"
                            v-show="searchCollege.showFlag.desired_universities_01">
                            <el-option v-for="item in searchCollege.filteredColleges" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>

                    <el-form-item label="院校名称">
                        <el-input v-model="Reporting.desired_universities_02"
                            @input="handleSearchCollege($event, 'desired_universities_02')" placeholder="请输入期待院校名称"
                            clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCollege.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_universities_02')"
                            v-show="searchCollege.showFlag.desired_universities_02">
                            <el-option v-for="item in searchCollege.filteredColleges" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>

                    <el-form-item label="院校名称">
                        <el-input v-model="Reporting.desired_universities_03"
                            @input="handleSearchCollege($event, 'desired_universities_03')" placeholder="请输入期待院校名称"
                            clearable style="width: max-content;"></el-input>
                        <el-select v-model="searchCollege.selectedValue" filterable placeholder="请选择"
                            @change=" handleSelectedMajor($event, 'desired_universities_03')"
                            v-show="searchCollege.showFlag.desired_universities_03">
                            <el-option v-for="item in searchCollege.filteredColleges" :key="item" :label="item"
                                :value="item"></el-option>
                        </el-select>
                    </el-form-item>
                </div>

                <el-form-item>
                    <el-button type="primary" @click="submitForm">提交</el-button>
                    <el-button @click="resetForm">重置</el-button>
                </el-form-item>

            </el-form>
        </div>

        <div name="reporting" v-show="showFlag.reporting">
            <h1>欢迎使用陌鼓志愿填报</h1>
            <el-card style="width: 100%;">
                <div slot="header">
                    <span>志愿推荐</span>
                </div>
                <el-table :data="result" height="250" border style="width: 100%;">
                    <el-table-column prop="col_id" label="学校代码"></el-table-column>
                    <el-table-column prop="col_name" label="学校名称"></el-table-column>
                    <el-table-column prop="MajorID" label="专业代码"></el-table-column>
                    <el-table-column prop="MajorName" label="专业名称"></el-table-column>
                    <el-table-column prop="MajorRanking" label="专业排名"></el-table-column>
                    <el-table-column prop="col_province" label="所在地区"></el-table-column>
                    <el-table-column prop="col_city" label="所在城市"></el-table-column>
                    <el-table-column prop="col_type" label="学校类型"></el-table-column>
                    <el-table-column prop="col_batch" label="批次"></el-table-column>
                    <el-table-column prop="col_is_public" label="是否公办"></el-table-column>
                    <el-table-column prop="col_is_958" label="是否985"></el-table-column>
                    <el-table-column prop="col_is_211" label="是否211"></el-table-column>
                    <el-table-column prop="Majortype" label="双一流层次"></el-table-column>
                    <el-table-column prop="totalNum" label="录取人数"></el-table-column>
                    <el-table-column prop="probability" label="录取概率"></el-table-column>
                </el-table>
            </el-card>
        </div>


        <div name="emptybox" v-show="showFlag.emptybox">
            <el-empty description="高考成绩尚未公布，敬请期待"></el-empty>
        </div>

    </div>
</template>


<script>
// 引入子组件


import { UserFormRules } from '@/datas/validationRules.js';
import axios from 'axios';




export default {
    name: 'ReportingContent',

    // 数据
    data() {
        return {
            Reporting: {
                route: 'reporting',
                Userarea_01: "",
                Userarea_02: "",
                Userarea_03: "",
                desired_major_01: "",
                desired_major_02: "",
                desired_major_03: "",
                desired_universities_01: "",
                desired_universities_02: "",
                desired_universities_03: "",
                grade_ch: 0,
                grade_ma: 0,
                grade_en: 0,
                grade_comp: 0,
                grade_total: 0,
                UserRanking: 0,
            },
            result: [
                {
                    col_id: "",
                    col_name: "",
                    MajorID: "",
                    MajorName: "",
                    MajorRanking: "",
                    col_province: "",
                    col_city: "",
                    col_type: "",
                    col_batch: "",
                    col_is_public: "",
                    col_is_985: "",
                    col_is_211: "",
                    Majortype: "",
                    totalNum: "",
                    probability: ""

                }
            ],
            showFlag: {
                reportingData: false,
                reporting: true,
                emptybox: false
            },
            searchCity: {
                inputValue: "",
                selectedValue: "",
                cities: [
                    "北京市", "天津市", "邯郸市", "石家庄市", "郑州市", "唐山市", "邢台市", "太原市", "晋中市", "长治市", "大同市", "运城市", "包头市", "呼和浩特市", "通辽市", "赤峰市", "沈阳市", "盘锦市", "鞍山市", "阜新市", "抚顺市", "大连市", "锦州市", "铁岭市", "长春市", "延边朝鲜族自治州", "吉林市", "通化市", "四平市", "白城市", "哈尔滨市", "秦皇岛市", "大庆市", "佳木斯市", "齐齐哈尔市", "上海市", "南京市", "苏州市", "镇江市", "徐州市", "常州市", "无锡市", "南通市", "盐城市", "杭州市", "金华市", "嘉兴市", "合肥市", "淮南市", "淮北市", "蚌埠市", "厦门市", "泉州市", "福州市", "南昌市", "赣州市", "上饶市", "吉安市", "济南市", "青岛市", "淄博市", "泰安市", "潍坊市", "烟台市", "临沂市", "济宁市", "德州市", "菏泽市", "焦作市", "新乡市", "信阳市", "周口市", "安阳市", "许昌市", "南阳市", "洛阳市", "武汉市", "荆州市", "黄冈市", "十堰市", "襄阳市", "湘潭市", "长沙市", "岳阳市", "衡阳市", "邵阳市", "常德市", "娄底市", "广州市", "韶关市", "惠州市", "海口市", "南宁市", "柳州市", "桂林市", "成都市", "重庆市", "绵阳市", "自贡市", "德阳市", "雅安市", "泸州市", "南充市", "内江市", "宜宾市", "达州市", "乐山市", "贵阳市", "昆明市", "大理白族自治州", "西安市", "咸阳市", "延安市", "汉中市", "渭南市", "兰州市", "庆阳市", "天水市", "西宁市", "银川市", "固原市", "乌鲁木齐市", "自治区直辖县级行政区划", "喀什地区", "和田地区", "吕梁市", "三门峡市", "辽源市", "景德镇市", "萍乡市", "驻马店市", "平顶山市", "黄石市", "牡丹江市", "开封市", "宜昌市", "三亚市", "廊坊市", "三明市", "龙岩市", "荆门市", "梧州市", "玉溪市", "榆林市", "安康市", "保定市", "乌兰察布市", "鸡西市", "九江市", "新余市", "益阳市", "株洲市", "文山壮族苗族自治州", "甘南藏族自治州", "连云港市", "钦州市", "黔南布依族苗族自治州", "平凉市", "陇南市", "日照市", "怀化市", "永州市", "威海市", "黔东南苗族侗族自治州", "沧州市", "聊城市", "克拉玛依市", "酒泉市", "石嘴山市", "吴忠市", "商丘市", "衡水市", "淮安市", "宿州市", "西双版纳傣族自治州", "张家界市", "承德市", "鹤岗市", "大兴安岭地区", "亳州市", "遂宁市", "铜仁市", "阿克苏地区", "临汾市", "恩施土家族苗族自治州", "咸宁市", "宁波市", "丽江市", "枣庄市", "宜春市", "抚州市", "漳州市", "朔州市", "宝鸡市", "省直辖县级行政区划", "珠海市", "双鸭山市", "乌海市", "七台河市", "商洛市", "铜川市", "扬州市", "泰州市", "百色市", "崇左市", "辽阳市", "本溪市", "宿迁市", "阿拉善盟", "广元市", "张家口市", "郴州市", "毕节市", "哈密市", "阳泉市", "鄂尔多斯市", "临夏回族自治州", "北京", "天津", "河北", "河南", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "上海", "江苏", "浙江", "安徽", "福建", "江西", "山东", "湖北", "湖南", "广东", "海南", "广西", "四川", "重庆", "贵州", "云南", "陕西", "甘肃", "青海", "宁夏", "新疆", "香港", "澳门"],
                filteredCitys: [],
                showFlag: {
                    Userarea_01: false,
                    Userarea_02: false,
                    Userarea_03: false,
                }
            },
            searchCollege: {
                inputValue: "",
                selectedValue: "",
                colleges: [
                    "北京大学", "中国人民大学", "清华大学", "北京交通大学", "北京工业大学", "北京航空航天大学", "北京理工大学", "北京科技大学", "北方工业大学", "北京化工大学", "北京工商大学", "北京邮电大学", "北京印刷学院", "北京建筑大学", "中国农业大学", "北京林业大学", "北京中医药大学", "北京外国语大学", "中国传媒大学", "中央财经大学", "北京物资学院", "首都经济贸易大学", "北京体育大学", "中央民族大学", "中国政法大学", "华北电力大学", "南开大学", "天津大学", "天津科技大学", "天津工业大学", "中国民航大学", "天津理工大学", "天津农学院", "天津医科大学", "天津师范大学", "天津职业技术师范大学", "天津外国语大学", "天津商业大学", "天津财经大学", "河北工程大学", "河北地质大学", "华北水利水电大学", "河北工业大学", "华北理工大学", "河北医科大学", "河北师范大学", "邯郸学院", "邢台学院", "石家庄铁道大学", "太原科技大学", "中北大学", "太原理工大学", "山西农业大学", "山西医科大学", "长治医学院", "太原师范学院", "山西大同大学", "晋中学院", "运城学院", "山西财经大学", "内蒙古科技大学", "内蒙古工业大学", "内蒙古农业大学", "内蒙古医科大学", "内蒙古师范大学", "内蒙古民族大学", "赤峰学院", "内蒙古财经大学", "辽宁大学", "大连理工大学盘锦校区", "沈阳工业大学", "东北大学", "辽宁科技大学", "辽宁工程技术大学", "辽宁石油化工大学", "沈阳化工大学", "大连交通大学", "大连海事大学", "大连工业大学", "沈阳建筑大学", "辽宁工业大学", "沈阳农业大学", "大连海洋大学", "中国医科大学", "锦州医科大学", "大连医科大学", "沈阳药科大学", "沈阳医学院", "辽宁师范大学", "鞍山师范学院", "东北财经大学", "铁岭师范高等专科学校", "吉林大学", "延边大学", "长春理工大学", "东北电力大学", "吉林化工学院", "吉林农业大学", "长春中医药大学", "东北师范大学", "北华大学", "通化师范学院", "吉林师范大学", "白城师范学院", "吉林财经大学", "吉林体育学院", "黑龙江大学", "哈尔滨工业大学", "哈尔滨理工大学", "燕山大学", "哈尔滨工程大学", "黑龙江科技大学", "东北石油大学", "佳木斯大学", "东北农业大学", "东北林业大学", "黑龙江中医药大学", "哈尔滨师范大学", "齐齐哈尔大学", "哈尔滨学院", "齐齐哈尔高等师范专科学校", "哈尔滨商业大学", "哈尔滨金融学院", "复旦大学", "同济大学", "上海交通大学", "华东理工大学", "上海理工大学", "上海海事大学", "东华大学", "上海电力大学", "上海应用技术大学", "上海健康医学院", "上海海洋大学", "华东师范大学", "上海外国语大学", "上海财经大学", "上海海关学院", "华东政法大学", "南京大学", "苏州大学", "东南大学", "南京航空航天大学", "南京理工大学", "江苏科技大学", "中国矿业大学", "南京工业大学", "常州大学", "南京邮电大学", "河海大学", "江南大学", "南京林业大学", "江苏大学", "南京信息工程大学", "南通大学", "盐城工学院", "南京农业大学", "南京中医药大学", "中国药科大学", "盐城师范学院", "苏州科技大学", "浙江大学", "杭州电子科技大学", "浙江工业大学", "浙江农林大学", "浙江师范大学", "浙江工商大学", "嘉兴学院", "中国计量大学", "中国科学技术大学", "合肥工业大学", "安徽理工大学", "安徽农业大学", "淮北师范大学", "安徽财经大学", "淮南师范学院", "厦门大学", "华侨大学", "福州大学", "福建工程学院", "福建农林大学", "集美大学", "福建医科大学", "闽江学院", "泉州师范学院", "南昌大学", "华东交通大学", "东华理工大学", "江西理工大学", "江西农业大学", "江西中医药大学", "赣南医学院", "江西师范大学", "上饶师范学院", "井冈山大学", "江西财经大学", "山东大学", "中国海洋大学", "山东科技大学", "中国石油大学（华东）", "青岛科技大学", "济南大学", "青岛理工大学", "山东建筑大学", "山东理工大学", "山东农业大学", "青岛农业大学", "潍坊医学院", "滨州医学院", "山东医学高等专科学校", "济宁医学院", "山东师范大学", "德州学院", "鲁东大学", "菏泽学院", "山东财经大学", "郑州大学", "河南理工大学", "郑州轻工业大学", "河南工业大学", "中原工学院", "河南农业大学", "河南科技学院", "河南中医药大学", "新乡医学院", "河南大学", "河南师范大学", "信阳师范学院", "周口师范学院", "安阳师范学院", "许昌学院", "南阳师范学院", "洛阳师范学院", "河南财经政法大学", "郑州航空工业管理学院", "武汉大学", "华中科技大学", "武汉科技大学", "长江大学", "武汉工程大学", "中国地质大学（武汉）", "武汉纺织大学", "武汉轻工大学", "武汉理工大学", "湖北工业大学", "华中农业大学", "华中师范大学", "湖北大学", "黄冈师范学院", "汉江师范学院", "湖北文理学院", "中南财经政法大学", "中南民族大学", "湘潭大学", "湖南大学", "中南大学", "湖南科技大学", "长沙理工大学", "湖南农业大学", "中南林业科技大学", "湖南中医药大学", "湖南师范大学", "湖南理工学院", "衡阳师范学院", "邵阳学院", "湖南文理学院", "湖南人文科技学院", "湖南工商大学", "南华大学", "中山大学", "暨南大学", "华南理工大学", "广州中医药大学", "韶关学院", "惠州学院", "海南大学", "广西大学", "广西科技大学", "桂林理工大学", "广西民族大学", "四川大学", "重庆大学", "西南交通大学", "电子科技大学", "西南石油大学", "成都理工大学", "重庆邮电大学", "重庆交通大学", "西南科技大学", "成都信息工程大学", "四川轻化工大学", "中国民用航空飞行学院", "四川农业大学", "重庆医科大学", "西南医科大学", "成都中医药大学", "川北医学院", "西南大学", "四川师范大学", "重庆师范大学", "西华师范大学", "绵阳师范学院", "内江师范学院", "宜宾学院", "重庆文理学院", "重庆三峡学院", "四川文理学院", "长江师范学院", "乐山师范学院", "西南财经大学", "西南政法大学", "西南民族大学", "贵州大学", "贵州医科大学", "贵州财经大学", "云南大学", "昆明理工大学", "云南农业大学", "西南林业大学", "昆明医科大学", "大理大学", "云南财经大学", "西北大学", "西安交通大学", "西北工业大学", "西安理工大学", "西安电子科技大学", "西安工业大学", "西安建筑科技大学", "西安科技大学", "西安石油大学", "陕西科技大学", "西安工程大学", "长安大学", "西北农林科技大学", "陕西中医药大学", "陕西师范大学", "延安大学", "陕西理工大学", "咸阳师范学院", "渭南师范学院", "西安外国语大学", "西北政法大学", "兰州大学", "兰州理工大学", "兰州交通大学", "甘肃农业大学", "甘肃中医药大学", "西北师范大学", "兰州城市学院", "陇东学院", "天水师范学院", "兰州财经大学", "西北民族大学", "青海大学", "青海民族大学", "宁夏大学", "宁夏医科大学", "宁夏师范学院", "新疆大学", "塔里木大学", "新疆农业大学", "石河子大学", "新疆师范大学", "喀什大学", "和田师范专科学校", "新疆财经大学", "天津城建大学", "河北科技师范学院", "山西中医药大学", "吕梁学院", "长沙医学院", "齐鲁医药学院", "明达职业技术学院", "长沙民政职业技术学院", "陕西工业职业技术学院", "湖南工业职业技术学院", "武汉职业技术学院", "辽宁对外经贸学院", "三门峡职业技术学院", "郑州铁路职业技术学院", "大连职业技术学院", "江西科技学院", "辽源职业技术学院", "无锡职业技术学院", "江苏建筑职业技术学院", "南京工业职业技术大学", "上海工商职业技术学院", "上海工程技术大学", "天津天狮学院", "内蒙古建筑职业技术学院", "江西医学高等专科学校", "景德镇学院", "萍乡学院", "黄淮学院", "平顶山学院", "湖北理工学院", "湖北医药学院", "吉林外国语大学", "杨凌职业技术学院", "新疆工程学院", "天津市职业大学", "邯郸职业技术学院", "沈阳大学", "牡丹江大学", "上海立信会计金融学院", "厦门理工学院", "青岛大学", "烟台大学", "潍坊学院", "郑州工程技术学院", "开封大学", "洛阳理工学院", "荆州理工职业学院", "三峡大学", "广州大学", "西安文理学院", "海南热带海洋学院", "华北科技学院", "成都工业学院", "齐齐哈尔医学院", "北京信息科技大学", "太原学院", "大连大学", "吉林工商学院", "南京工程学院", "南京审计大学", "三明学院", "龙岩学院", "福建商学院", "江西科技师范大学", "南昌工程学院", "河南工学院", "安阳工学院", "湖北工业职业技术学院", "荆楚理工学院", "梧州学院", "玉溪师范学院", "云南警官学院", "榆林学院", "安康学院", "甘肃政法大学", "北方民族大学", "中国矿业大学（北京）", "中国石油大学（北京）", "中国地质大学（北京）", "北京联合大学", "河北金融学院", "集宁师范学院", "长春汽车工业高等专科学校", "长春工程学院", "长春金融高等专科学校", "黑龙江工业学院", "黑龙江职业学院", "上海电机学院", "南京晓庄学院", "浙江财经大学", "九江职业大学", "新余学院", "山东交通学院", "河南工程学院", "焦作大学", "湖南城市学院", "湖南工学院", "湖南财政经济学院", "湖南工业大学", "广东金融学院", "重庆科技学院", "文山学院", "西安财经大学", "甘肃民族师范学院", "兰州文理学院", "连云港师范高等专科学校", "湖北经济学院", "北部湾大学", "沈阳工程学院", "浙江传媒学院", "河南财政金融学院", "南阳理工学院", "海南师范大学", "重庆理工大学", "黔南民族医学高等专科学校", "西安邮电大学", "山东工商学院", "长春大学", "上海出版印刷高等专科学校", "西安航空学院", "防灾科技学院", "九江职业技术学院", "重庆工商大学", "甘肃医学院", "陇南师范高等专科学校", "海南医学院", "新疆维吾尔医学专科学校", "长春医学高等专科学校", "西安电力高等专科学校", "上海杉达学院", "黄河科技学院", "桂林旅游学院", "西安医学院", "九江学院", "广东工业大学", "徐州工程学院", "大连民族大学", "广州民航职业技术学院", "上海第二工业大学", "江苏经贸职业技术学院", "南京特殊教育师范学院", "吉林交通职业技术学院", "上海商学院", "九州职业技术学院", "长沙航空职业技术学院", "黄河水利职业技术学院", "日照职业技术学院", "天津中德应用技术大学", "南方医科大学", "南京森林警察学院", "湖南医药学院", "重庆工业职业技术学院", "湖南大众传媒职业技术学院", "永州职业技术学院", "湖南铁道职业技术学院", "湖南涉外经济学院", "海口经济学院", "武昌理工学院", "青岛职业技术学院", "威海职业学院", "山东职业学院", "烟台南山学院", "贵州电子信息职业技术学院", "云南国土资源职业学院", "武汉生物工程学院", "武汉工贸职业学院", "湖南交通职业技术学院", "沧州职业技术学院", "石家庄铁路职业技术学院", "湖南工程职业技术学院", "聊城职业技术学院", "中国劳动关系学院", "克拉玛依职业技术学院", "天津滨海职业学院", "上海城建职业学院", "上海海事职业技术学院", "上海电子信息职业技术学院", "陕西能源职业技术学院", "酒泉职业技术学院", "宁夏理工学院", "青海卫生职业技术学院", "上海震旦职业学院", "上海思博职业技术学院", "上海立达学院", "辽宁理工职业大学", "保险职业学院", "重庆机电职业技术大学", "重庆城市科技学院", "广州软件学院", "广东外语外贸大学南国商学院", "福建信息职业技术学院", "泉州医学高等专科学校", "成都东软学院", "四川水利职业技术学院", "南充职业技术学院", "四川邮电职业技术学院", "南华大学船山学院", "湖南理工学院南湖学院", "内蒙古机电职业技术学院", "内蒙古商贸职业学院", "江苏海事职业技术学院", "江苏航运职业技术学院", "泉州纺织服装职业学院", "西安欧亚学院", "西安外事学院", "西安翻译学院", "西京学院", "宁夏民族职业技术学院", "三亚城市职业学院", "天津渤海职业技术学院", "天津电子信息职业技术学院", "天津机电职业技术学院", "天津现代职业技术学院", "天津公安警官职业学院", "天津轻工职业技术学院", "荆州职业技术学院", "商丘职业技术学院", "郑州工业应用技术学院", "平顶山工业职业技术学院", "周口职业技术学院", "湖北交通职业技术学院", "重庆信息技术职业学院", "重庆城市管理职业学院", "重庆工程职业技术学院", "四川交通职业技术学院", "四川工程职业技术学院", "四川建筑职业技术学院", "江西工程学院", "秦皇岛职业技术学院", "山西药科职业学院", "石家庄工程职业学院", "石家庄城市经济职业学院", "唐山职业技术学院", "衡水职业技术学院", "天津商务职业学院", "南昌理工学院", "上海济光职业技术学院", "上海建桥学院", "上海工商外国语职业学院", "天津国土资源和房屋职业学院", "江苏电子信息职业学院", "常州纺织服装职业技术学院", "安徽文达信息工程学院", "宿州职业技术学院", "西双版纳职业技术学院", "陕西国防工业职业技术学院", "西安航空职业技术学院", "陕西财经职业技术学院", "陕西交通职业技术学院", "陕西职业技术学院", "兰州外语职业学院", "兰州职业技术学院", "甘肃警察职业学院", "甘肃林业职业技术学院", "甘肃工业职业技术学院", "宁夏工业职业学院", "德州科技职业学院", "张家界航空工业职业技术学院", "昆明艺术职业学院", "浙江金融职业学院", "天津医学高等专科学校", "天津交通职业学院", "邢台医学高等专科学校", "河北旅游职业学院", "山西机电职业技术学院", "山西林业职业技术学院", "辽宁金融职业学院", "辽宁广告职业学院", "辽宁经济职业技术学院", "鹤岗师范高等专科学校", "哈尔滨铁道职业技术学院", "大兴安岭职业学院", "哈尔滨职业技术学院", "上海邦德职业技术学院", "上海中侨职业技术大学", "南京科技职业学院", "亳州学院", "泉州华光职业学院", "江西司法警官职业学院", "江西应用科技学院", "江西财经职业学院", "江西应用技术职业学院", "江西工业工程职业技术学院", "山东水利职业学院", "山东畜牧兽医职业学院", "郑州师范学院", "焦作师范高等专科学校", "湖北中医药高等专科学校", "四川职业技术学院", "青海农牧科技职业学院", "青海交通职业技术学院", "青海建筑职业技术学院", "江西机电职业技术学院", "武汉铁路职业技术学院", "湖北三峡职业技术学院", "湖北水利水电职业技术学院", "武汉警官职业学院", "武汉外语外事职业学院", "山东英才学院", "山东交通职业学院", "淄博职业学院", "青岛酒店管理职业技术学院", "青岛恒星科技学院", "长沙环境保护职业技术学院", "常德职业技术学院", "湖南化工职业技术学院", "湖南城建职业技术学院", "湖南石油化工职业技术学院", "雅安职业技术学院", "铜仁职业技术学院", "石家庄财经职业学院", "河北交通职业技术学院", "河北化工医药职业技术学院", "河北对外经贸职业学院", "宁夏职业技术学院", "宁夏工商职业技术学院", "宁夏财经职业技术学院", "宁夏警官职业学院", "阿克苏职业技术学院", "常州工业职业技术学院", "常州工程职业技术学院", "江苏农林职业技术学院", "徐州工业职业技术学院", "厦门工学院", "西安思源学院", "西安高新科技职业学院", "陕西国际商贸学院", "西安城市建设职业学院", "陕西服装工程学院", "宁夏建设职业技术学院", "长春职业技术学院", "临汾职业技术学院", "大连工业大学艺术与信息工程学院", "沈阳城市建设学院", "大连医科大学中山学院", "锦州医科大学医疗学院", "大连财经学院", "武汉城市学院", "三峡大学科技学院", "武昌工学院", "荆州学院", "长江大学文理学院", "湖北医药学院药护学院", "湖北恩施学院", "湖北文理学院理工学院", "文华学院", "武汉交通职业学院", "咸宁职业技术学院", "长江工程职业技术学院", "宁波大学科学技术学院", "哈尔滨远东理工学院", "哈尔滨华德学院", "青岛黄海学院", "青岛求实职业技术学院", "山东现代学院", "山东协和学院", "宁夏大学新华学院", "丽江文化旅游学院", "昆明理工大学津桥学院", "昆明文理学院", "昆明医科大学海源学院", "烟台理工学院", "聊城大学东昌学院", "青岛城市学院", "枣庄科技职业学院", "河北科技学院", "河北机电职业技术学院", "廊坊职业技术学院", "石家庄邮电职业技术学院", "石家庄工商职业学院", "石家庄理工职业学院", "河北外国语学院", "石家庄科技信息职业学院", "华北理工大学轻工学院", "河北医科大学临床学院", "江西服装学院", "江西科技职业学院", "南昌工学院", "宜春职业技术学院", "南昌交通学院", "赣东学院", "南昌航空大学科技学院", "赣南科技学院", "南昌医学院", "江西师范大学科学技术学院", "江西财经大学现代经济管理学院", "厦门大学嘉庚学院", "福州大学至诚学院", "郑州财经学院", "河南开封科技传媒学院", "兰州工商学院", "兰州博文科技学院", "兰州信息科技学院", "甘肃交通职业技术学院", "山西工学院", "晋中信息学院", "山西晋中理工学院", "重庆人文科技学院", "陕西铁路工程职业技术学院", "宝鸡职业技术学院", "西安交通工程学院", "陕西电子信息职业技术学院", "金陵科技学院", "海南软件职业技术学院", "海南政法职业学院", "河北工程大学科信学院", "重庆外语外事学院", "重庆对外经贸学院", "重庆财经学院", "重庆工商大学派斯学院", "石家庄铁道大学四方学院", "河北地质大学华信学院", "长春电子科技学院", "长春财经学院", "长春建筑学院", "长春科技学院", "辽宁中医药大学杏林学院", "蚌埠工商学院", "沈阳科技学院", "长春大学旅游学院", "泰山科技学院", "重庆移通学院", "北京工商大学嘉华学院", "大连东软信息学院", "长沙理工大学城南学院", "上海外国语大学贤达经济人文学院", "贵州黔南经济学院", "南京航空航天大学金城学院", "天津外国语大学滨海外事学院", "天津商业大学宝德学院", "天津医科大学临床医学院", "南开大学滨海学院", "电子科技大学成都学院", "武汉华夏理工学院", "广州商学院", "成都理工大学工程技术学院", "成都银杏酒店管理学院", "四川工商学院", "四川外国语大学成都学院", "青海大学昆仑学院", "北京理工大学珠海学院", "西安交通大学城市学院", "西安建筑科技大学华清学院", "西安财经大学行知学院", "陕西科技大学镐京学院", "西安工商学院", "延安大学西安创新学院", "珠海科技学院", "山西管理职业学院", "天津工业职业学院", "天津石油职业技术学院", "天津城市职业学院", "吉林医药学院", "北京培黎职业学院", "黑龙江旅游职业技术学院", "黑龙江能源职业学院", "重庆水利电力职业技术学院", "陕西邮电职业技术学院", "西安海棠职业学院", "西安汽车职业大学", "无锡城市职业技术学院", "无锡工艺职业技术学院", "金山职业技术学院", "云南林业职业技术学院", "福建江夏学院", "厦门华天涉外职业技术学院", "江西中医药高等专科学校", "沧州医学高等专科学校", "南阳医学高等专科学校", "商丘医学高等专科学校", "永城职业学院", "河南经贸职业学院", "郑州旅游职业学院", "江汉艺术职业学院", "武汉民政职业学院", "湖北财税职业学院", "湖南财经工业职业技术学院", "益阳职业技术学院", "琼台师范学院", "陕西警官职业学院", "银川能源学院", "广西演艺职业学院", "湖南信息学院", "山东旅游职业学院", "山东铝业职业学院", "泰山职业技术学院", "天津铁道职业技术学院", "江西航空职业技术学院", "赣西科技职业学院", "三亚学院", "上海师范大学天华学院", "燕京理工学院", "天津师范大学津沽学院", "天津理工大学中环信息学院", "北京科技大学天津学院", "北京中医药大学东方学院", "北京邮电大学世纪学院", "成都锦城学院", "北京工业大学耿丹学院", "乌海职业技术学院", "七台河职业学院", "湖南理工职业技术学院", "新疆交通职业技术学院", "三亚航空旅游职业学院", "陕西经济管理职业技术学院", "湖南水利水电职业技术学院", "广州铁路职业技术学院", "西安铁路职业技术学院", "咸阳职业技术学院", "西安职业技术学院", "商洛职业技术学院", "汉中职业技术学院", "延安职业技术学院", "渭南职业技术学院", "安康职业技术学院", "铜川职业技术学院", "新疆石河子职业技术学院", "苏州百年职业学院", "山东药品食品职业学院", "厦门城市职业学院", "厦门兴才职业技术学院", "无锡学院", "南京邮电大学通达学院", "常州大学怀德学院", "南京审计大学金审学院", "青岛工学院", "齐鲁理工学院", "商丘学院", "重庆三峡医药高等专科学校", "四川中医药高等专科学校", "大庆医学高等专科学校", "石家庄医学高等专科学校", "天津城市建设管理职业技术学院", "天津生物工程职业技术学院", "天津海运职业学院", "陕西青年职业学院", "西安信息职业大学", "陕西旅游烹饪职业学院", "西南财经大学天府学院", "天津仁爱学院", "西安理工大学高科学院", "西安科技大学高新学院", "绵阳城市学院", "吉林铁道职业技术学院", "黑龙江交通职业技术学院", "厦门软件职业技术学院", "三峡电力职业学院", "百色职业学院", "辽宁装备制造职业技术学院", "天津财经大学珠江学院", "运城幼儿师范高等专科学校", "太原工业学院", "哈尔滨科学技术职业学院", "厦门东海职业技术学院", "湖北科技职业学院", "新疆职业大学", "北京社会管理职业学院", "石家庄人民医学高等专科学校", "苏州高博软件技术职业学院", "江西新能源科技职业学院", "广西理工职业技术学院", "南京旅游职业学院", "包头铁道职业技术学院", "辽宁铁道职业技术学院", "辽宁建筑职业学院", "枣庄职业学院", "湖北工程职业学院", "银川科技学院", "内蒙古鸿德文理学院", "石家庄科技职业学院", "乌兰察布医学高等专科学校", "四川幼儿师范高等专科学校", "西安医学高等专科学校", "河北东方学院", "大连汽车职业技术学院", "泉州海洋职业学院", "三亚理工职业学院", "江西冶金职业技术学院", "安阳职业技术学院", "新乡职业技术学院", "重庆交通职业学院", "晋中师范高等专科学校", "承德护理职业学院", "辽宁冶金职业技术学院", "铁岭卫生职业学院", "宿迁泽达职业技术学院", "苏州工业园区服务外包职业学院", "长垣烹饪职业技术学院", "开封文化艺术职业学院", "榆林职业技术学院", "甘肃机电职业技术学院", "石家庄幼儿师范高等专科学校", "徐州幼儿师范高等专科学校", "廊坊卫生职业学院", "阿拉善职业技术学院", "济南护理职业学院", "泰山护理职业学院", "河南护理职业学院", "许昌电气职业学院", "南阳职业学院", "襄阳汽车职业技术学院", "宁夏葡萄酒与防沙治沙职业技术学院", "河南推拿职业学院", "洛阳职业技术学院", "郑州幼儿师范高等专科学校", "安阳幼儿师范高等专科学校", "川北幼儿师范高等专科学校", "上海民航职业技术学院", "运城护理职业学院", "郑州黄河护理职业学院", "四川汽车职业技术学院", "新疆师范高等专科学校", "山西传媒学院", "贵州理工学院", "张家口学院", "运城师范高等专科学校", "渤海理工职业学院", "辽宁轻工职业学院", "陕西艺术职业学院", "新疆铁道职业技术学院", "宜春幼儿师范高等专科学校", "湘南幼儿师范高等专科学校", "宁夏幼儿师范高等专科学校", "毕节医学高等专科学校", "四川西南航空职业学院", "宁夏艺术职业学院", "新疆生产建设兵团兴新职业技术学院", "哈密职业技术学院", "新疆科技职业技术学院", "山西工程技术学院", "鄂尔多斯应用技术学院", "临夏现代职业学院", "武汉海事职业学院", "荆门职业学院", "江苏安全技术职业学院", "武汉铁路桥梁职业学院", "天津滨海汽车工程职业学院", "吉林水利电力职业学院", "三亚中瑞酒店管理职业学院", "河北石油职业技术大学", "河北科技工程职业技术大学", "河北工业职业技术大学", "兰州资源环境职业技术大学", "兰州石化职业技术大学", "宁波诺丁汉大学", "北京师范大学 - 香港浸会大学联合国际学院", "西交利物浦大学", "盐城幼儿师范高等专科学校", "陕西机电职业技术学院", "山西能源学院", "河北环境工程学院", "上海交通大学医学院",
                ],
                filteredColleges: [],
                showFlag: {
                    Userarea_01: false,
                    Userarea_02: false,
                    Userarea_03: false,
                }
            },
            searchMajor: {
                inputValue: "",
                selectedValue: "",
                majors:
                    ["法学", "国际经济发展合作", "国际经贸规则", "国际税收", "国民经济管理", "互联网金融", "金融科技", "金融数学", "金融学", "经济工程", "精算学", "劳动经济学", "伦理学", "能源经济", "数字经济", "信用管理", "知识产权", "资源与环境经济学", "阿尔巴尼亚语", "阿非利卡语", "阿拉伯语", "阿姆哈拉语", "阿塞拜疆语", "爱尔兰语", "爱沙尼亚语", "安全防范工程", "安全工程", "安全生产监管", "白俄罗斯语", "白酒酿造工程", "包装工程", "包装设计", "宝石及材料工艺学", "保加利亚语", "保密管理", "保密技术", "保险学", "比斯拉马语", "边防管理", "边防指挥", "编辑出版学", "标准化工程", "表演", "冰岛语", "冰雪运动", "波兰语", "波斯语", "播音与主持艺术", "材料成型及控制工程", "材料化学", "材料科学与工程", "材料设计科学与工程", "材料物理", "财务管理", "财务会计教育", "财政学", "采购管理", "采矿工程", "蚕学", "藏药学", "藏医学", "草坪科学与工程", "草业科学", "测绘工程", "测控技术与仪器", "茶学", "产品设计", "朝鲜语", "车辆工程", "城市地下空间工程", "城市管理", "城市设计", "城市水系统工程", "城乡规划", "出入境管理", "储能科学与工程", "传播学", "船舶电子电气工程", "船舶与海洋工程", "创业管理", "茨瓦纳语", "慈善管理", "达里语", "大气科学", "大数据管理与应用", "傣医学", "丹麦语", "弹药工程与爆炸技术", "档案学", "导航工程", "道路桥梁与渡河工程", "德顿语", "德语", "地理国情监测", "地理科学", "地理空间信息工程", "地理信息科学", "地球化学", "地球物理学", "地球系统科学", "地球信息科学与技术", "地下水科学与工程", "地质工程", "地质学", "迪维希语", "电波传播与天线", "电磁场与无线技术", "电动载运工程", "电机电器智能化", "电缆工程", "电气工程及其自动化", "电气工程与智能控制", "电信工程及管理", "电影学", "电影制作", "电子封装技术", "电子竞技运动与管理", "电子科学与技术", "电子商务", "电子商务及法律", "电子信息工程", "电子信息科学与技术", "电子与计算机工程", "雕塑", "动画", "动物科学", "动物药学", "动物医学", "动植物检疫", "俄语", "恩德贝莱语", "儿科学", "法医学", "法语", "翻译", "反恐警务", "犯罪学", "梵语巴利语", "防灾减灾科学与工程", "房地产开发与管理", "仿生科学与工程", "纺织工程", "放射医学", "飞行技术", "飞行器动力工程", "飞行器环境与生命保障工程", "飞行器控制与信息工程", "飞行器设计与工程", "飞行器适航技术", "飞行器运维工程", "飞行器制造工程", "飞行器质量与可靠性", "非物质文化遗产保护", "非织造材料与工程", "菲律宾语", "斐济语", "分子科学与工程", "芬兰语", "粉体材料科学与工程", "风景园林", "蜂学", "服务科学与工程", "服装设计与工程", "服装设计与工艺教育", "服装与服饰设计", "辐射防护与核安全", "妇幼保健医学", "复合材料成型工程", "复合材料与工程", "港口航道与海岸工程", "高分子材料与工程", "格鲁吉亚语", "给排水科学与工程", "工程管理", "工程力学", "工程审计", "工程物理", "工程造价", "工会学", "工商管理", "工业工程", "工业设计", "工业智能", "工艺美术", "公安管理学", "公安情报学", "公安视听技术", "公安政治工作", "公共关系学", "公共事业管理", "公共艺术", "功能材料", "供应链管理", "孤独症儿童教育", "古典文献学", "古生物学", "古文字学", "管理科学", "光电信息材料与器件", "光电信息科学与工程", "光源与照明", "广播电视编导", "广播电视工程", "广播电视学", "广告学", "轨道交通电气与控制", "轨道交通信号与控制", "国际法", "国际经济与贸易", "国际商务", "国际事务与国际关系", "国际新闻与传播", "国际政治", "国际组织与全球治理", "国家公园建设与管理", "国内安全保卫", "过程装备与控制工程", "哈萨克语", "哈医学", "海关管理", "海关稽查", "海关检验检疫安全", "海警后勤管理", "海警舰艇指挥与技术", "海警执法", "海事管理", "海外安全管理", "海洋工程与技术", "海洋机器人", "海洋技术", "海洋科学", "海洋信息工程", "海洋药学", "海洋油气工程", "海洋渔业科学与技术", "海洋资源开发技术", "海洋资源与环境", "汉语国际教育", "汉语言", "汉语言文学", "焊接技术与工程", "航海技术", "航空安防管理", "航空服务艺术与管理", "航空航天工程", "豪萨语", "合成生物学", "荷兰语", "核电技术与控制工程", "核工程与核技术", "核化工与核燃料工程", "核生化消防", "核物理", "护理学", "华文教育", "化工安全工程", "化学", "化学测量学与技术", "化学工程与工业生物工程", "化学工程与工艺", "化学生物学", "化妆品技术与工程", "化妆品科学与技术", "环保设备工程", "环境工程", "环境科学", "环境科学与工程", "环境设计", "环境生态工程", "回医学", "会计学", "会展", "会展经济与管理", "绘画", "火灾勘查", "机电技术教育", "机器人工程", "机械电子工程", "机械工程", "机械工艺技术", "机械设计制造及其自动化", "基础医学", "吉尔吉斯语", "集成电路设计与集成系统", "计算机科学与技术", "计算金融", "纪检监察", "技术侦查学", "加泰罗尼亚语", "家具设计与工程", "家庭教育", "家政学", "假肢矫形工程", "监狱学", "柬埔寨语", "建筑电气与智能化", "建筑环境与能源应用工程", "建筑学", "健康服务与管理", "交通工程", "交通管理", "交通管理工程", "交通设备与控制工程", "交通运输", "教育技术学", "教育康复学", "教育学", "捷克语", "金融工程", "金融审计", "金属材料工程", "禁毒学", "经济动物学", "经济犯罪侦查", "经济林", "经济统计学", "经济学", "经济与金融", "精密仪器", "精神医学", "精细化工", "警犬技术", "警卫学", "警务指挥与战术", "酒店管理", "救助与打捞工程", "军事海洋学", "菌物科学与工程", "勘查技术与工程", "康复工程", "康复物理治疗", "康复治疗学", "康复作业治疗", "考古学", "科技艺术", "科摩罗语", "科学教育", "科学社会主义", "科学史", "可持续能源", "克里奥尔语", "克罗地亚语", "空间科学与技术", "空间信息与数字技术", "空天智能电推进技术", "口腔医学", "口腔医学技术", "库尔德语", "库克群岛毛利语", "跨境电子商务", "跨媒体艺术", "矿物加工工程", "矿物资源工程", "拉丁语", "拉脱维亚语", "劳动关系", "劳动教育", "劳动与社会保障", "老年学", "老挝语", "理论与应用力学", "历史建筑保护工程", "历史学", "立陶宛语", "粮食工程", "量子信息科学", "林产化工", "林学", "临床工程技术", "临床药学", "临床医学", "零售业管理", "流行舞蹈", "流行音乐", "隆迪语", "卢森堡语", "卢旺达语", "录音艺术", "轮机工程", "罗马尼亚语", "逻辑学", "旅游地学与规划工程", "旅游管理", "旅游管理与服务教育", "麻醉学", "马达加斯加语", "马耳他语", "马克思主义理论", "马来语", "马其顿语", "马业科学", "漫画", "毛利语", "贸易经济", "美术教育", "美术学", "蒙古语", "蒙药学", "蒙医学", "孟加拉语", "秘书学", "密码科学与技术", "缅甸语", "民族学", "木材科学与工程", "木结构建筑与材料", "纳米材料与技术", "能源服务工程", "能源互联网工程", "能源化学", "能源化学工程", "能源与动力工程", "能源与环境系统工程", "尼泊尔语", "酿酒工程", "纽埃语", "农村区域发展", "农林经济管理", "农学", "农药化肥", "农业电气化", "农业工程", "农业机械化及其自动化", "农业建筑环境与能源工程", "农业水利工程", "农业智能装备工程", "农业资源与环境", "农艺教育", "挪威语", "女性学", "旁遮普语", "烹饪与营养教育", "皮金语", "葡萄牙语", "葡萄与葡萄酒工程", "普什图语", "气象技术与工程", "汽车服务工程", "汽车维修工程教育", "抢险救援指挥与技术", "切瓦语", "轻化工程", "氢能科学与工程", "区块链工程", "曲艺", "全球健康学", "人工智能", "人居环境科学与技术", "人类学", "人力资源管理", "人文地理与城乡规划", "人文教育", "认知科学与技术", "日语", "融合教育", "柔性电子学", "乳品工程", "软件工程", "瑞典语", "萨摩亚语", "塞尔维亚语", "塞苏陀语", "桑戈语", "森林保护", "森林工程", "僧伽罗语", "商务经济学", "商务英语", "绍纳语", "设施农业科学与工程", "社会工作", "社会体育指导与管理", "社会学", "社会政策", "社区矫正", "涉外警务", "摄影", "神经科学", "审计学", "生态学", "生物材料", "生物工程", "生物技术", "生物科学", "生物农药科学与工程", "生物统计学", "生物信息学", "生物医学", "生物医学工程", "生物医学科学", "生物医药数据科学", "生物育种科学", "生物制药", "生物质科学与工程", "生物质能源与材料", "声学", "湿地保护与恢复", "石油工程", "时尚传播", "实验动物学", "实验艺术", "食品安全与检测", "食品科学与工程", "食品卫生与营养学", "食品药品环境犯罪侦查技术", "食品营养与检验教育", "食品营养与健康", "食品质量与安全", "食用菌科学与工程", "世界史", "世界语", "市场营销", "市场营销教育", "视觉传达设计", "手语翻译", "兽医公共卫生", "书法学", "数据计算及应用", "数据警务技术", "数据科学", "数据科学与大数据技术", "数理基础科学", "数学与应用数学", "数字出版", "数字媒体技术", "数字媒体艺术", "数字人文", "水产养殖学", "水利科学与工程", "水利水电工程", "水生动物医学", "水声工程", "水土保持与荒漠化防治", "水文与水资源工程", "水务工程", "水质科学与技术", "水族科学与技术", "税收学", "司法鉴定学", "司法警察学", "丝绸设计与工程", "思想政治教育", "斯洛伐克语", "斯洛文尼亚语", "斯瓦希里语", "饲料工程", "索马里语", "塔吉克语", "塔玛齐格特语", "泰米尔语", "泰语", "探测制导与控制技术", "碳储科学与工程", "汤加语", "陶瓷艺术设计", "特殊教育", "特种能源技术与工程", "提格雷尼亚语", "体能训练", "体育教育", "体育经济与管理", "体育旅游", "天文学", "铁道工程", "铁路警务", "听力与言语康复学", "通信工程", "统计学", "投资学", "图书馆学", "涂料工程", "土地科学与技术", "土地整治工程", "土地资源管理", "土耳其语", "土库曼语", "土木、水利与海洋工程", "土木、水利与交通工程", "土木工程", "外国语言与外国历史", "外交学", "网络安全与执法", "网络工程", "网络空间安全", "网络与新媒体", "微电子科学与工程", "微机电系统工程", "维医学", "卫生监督", "卫生检验与检疫", "卫生教育", "未来机器人", "文化产业管理", "文化遗产", "文物保护技术", "文物保护与修复", "文物与博物馆学", "乌尔都语", "乌克兰语", "乌兹别克语", "无机非金属材料工程", "无人驾驶航空器系统工程", "无障碍管理", "武器发射工程", "武器系统与工程", "武术与民族传统体育", "舞蹈编导", "舞蹈表演", "舞蹈教育", "舞蹈学", "物理学", "物联网工程", "物流工程", "物流管理", "物业管理", "西班牙语", "希伯来语", "希腊语", "戏剧教育", "戏剧学", "戏剧影视导演", "戏剧影视美术设计", "戏剧影视文学", "系统科学与工程", "纤维艺术", "乡村治理", "香料香精技术与工程", "消防工程", "消防政治工作", "消防指挥", "小学教育", "心理学", "新媒体技术", "新媒体艺术", "新能源材料与器件", "新能源科学与工程", "新能源汽车工程", "新闻学", "信息安全", "信息对抗技术", "信息工程", "信息管理与信息系统", "信息与计算科学", "信息资源管理", "信用风险管理与法律防控", "刑事科学技术", "行星科学", "行政管理", "匈牙利语", "休闲体育", "虚拟现实技术", "学前教育", "亚美尼亚语", "烟草", "眼视光学", "眼视光医学", "养老服务管理", "遥感科学与技术", "药事管理", "药物分析", "药物化学", "药物制剂", "药学", "冶金工程", "野生动物与自然保护区管理", "医工学", "医疗保险", "医疗产品管理", "医学检验技术", "医学实验技术", "医学信息工程", "医学影像技术", "医学影像学", "移民管理", "艺术管理", "艺术教育", "艺术设计学", "艺术史论", "艺术与科技", "意大利语", "音乐表演", "音乐教育", "音乐剧", "音乐学", "音乐治疗", "印地语", "印度尼西亚语", "印刷工程", "应急管理", "应急技术与管理", "应急装备技术与工程", "应用电子技术教育", "应用化学", "应用气象学", "应用生物科学", "应用统计学", "应用物理学", "应用心理学", "应用语言学", "英语", "影视技术", "影视摄影与制作", "邮轮工程与管理", "邮政工程", "邮政管理", "油气储运工程", "语言学", "预防医学", "园林", "园艺", "园艺教育", "约鲁巴语", "越南语", "运动康复", "运动能力开发", "运动人体科学", "运动训练", "运动与公共健康", "增材制造工程", "爪哇语", "哲学", "针灸推拿学", "侦查学", "整合科学", "政治学、经济学与哲学", "政治学与行政学", "职业卫生工程", "植物保护", "植物科学与技术", "制药工程", "质量管理工程", "治安学", "智慧海洋技术", "智慧建筑与建造", "智慧交通", "智慧林业", "智慧牧业科学与工程", "智慧能源工程", "智慧农业", "智慧水利", "智能材料与结构", "智能采矿工程", "智能测控工程", "智能车辆工程", "智能地球探测", "智能电网信息工程", "智能飞行器技术", "智能感知工程", "智能工程与创意设计", "智能建造", "智能建造与智慧交通", "智能交互设计", "智能科学与技术", "智能体育工程", "智能无人系统技术", "智能医学工程", "智能影像工程", "智能运输工程", "智能制造工程", "智能装备与系统", "中草药栽培与鉴定", "中国共产党历史", "中国画", "中国少数民族语言文学", "中国语言与文化", "中兽医学", "中西医临床医学", "中药学", "中药制药", "中药资源与开发", "中医儿科学", "中医骨伤科学", "中医康复学", "中医学", "中医养生学", "种子科学与工程", "珠宝首饰设计与工艺", "助产学", "装甲车辆工程", "壮医学", "资产评估", "资源化学", "资源环境大数据工程", "资源环境科学", "资源勘查工程", "资源循环科学与工程", "自动化", "自然地理与资源环境", "自然资源登记与管理", "祖鲁语", "作曲与作曲技术理论", "宗教学",
                    ],
                filteredMajors: [],
                showFlag: {
                    desired_major_01: false,
                    desired_major_02: false,
                    desired_major_03: false,
                }
            },
            // 表单验证
            rules: {
                UserFormRules
            },

        };
    },

    // 方法
    methods: {
        handleSearchCity(query, showFlag) {
            this.searchCity.showFlag[showFlag] = true;

            this.searchCity.filteredCitys = this.searchCity.cities.filter(city => city.includes(query));
        },
        handleSelectedCity(selectedValue, id) {
            this.Reporting[id] = selectedValue;
            this.searchCity.showFlag[id] = false;
        },

        handleSearchCollege(query, showFlag) {
            this.searchCollege.showFlag[showFlag] = true;

            this.searchCollege.filteredColleges = this.searchCollege.colleges.filter(college => college.includes(query));
        },
        handleSelectedCollege(selectedValue, id) {
            this.Reporting[id] = selectedValue;
            this.searchCollege.showFlag[id] = false;
        },

        handleSearchMajor(query, showFlag) {
            this.searchMajor.showFlag[showFlag] = true;

            this.searchMajor.filteredMajors = this.searchMajor.majors.filter(major => major.includes(query));
        },
        handleSelectedMajor(selectedValue, id) {
            this.Reporting[id] = selectedValue;
            this.searchCollege.showFlag[id] = false;
        },
        submitForm() {
            console.log(this.Reporting);
            for (const key in this.Reporting) {
                if (!this.Reporting[key]) {
                    this.$message.error({
                        message: "请填写完整信息",
                        duration: 2000
                    });
                    return false;
                } else {
                    axios.post("/", this.Reporting)
                        .then((res) => {
                            this.showFlag.reportingData = false;
                            this.showFlag.personal = true;
                            this.result = res.data;
                        })
                        .catch(error => {
                            console.error(error);
                        });
                }
            }
        },
        resetForm() {
            for (const key in this.Reporting) {
                this.Reporting[key] = "";

            }
        }
    },
    mounted() {
        axios.post("/", this.Reporting)
            .then((res) => {
                if (res.data.code === 1) {
                    this.showFlag.reportingData = true;
                    this.showFlag.reporting = false;
                } else if (res.data.code === 4) {
                    this.showFlag.reportingData = false;
                    this.showFlag.personal = true;
                } else {
                    this.showFlag.emptybox = true;
                    this.showFlag.reporting = false;
                    this.showFlag.reportingData = false;
                }
            })
            .catch(error => {
                console.error(error);
            });

    }
}
</script>